CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
/***************************************************************************//**
 * Dariusz Adamczyk
 *
 * Compatible soc's:
 *
 * EFR32BG22 - IM40
 * EFR32BG22 - GM32
 *
 * @file app.c
 * @brief Application code
 *******************************************************************************
 *******************************************************************************
 ******************************************************************************/

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include "em_common.h"
#include "sl_status.h"
#include "sl_bluetooth.h"
#include "app.h"
#include "gatt_db.h"
#include "sl_sleeptimer.h"
#include "em_gpio.h"
#include "em_usart.h"
#include "em_i2c.h"

#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif // SL_COMPONENT_CATALOG_PRESENT

#ifdef SL_CATALOG_APP_LOG_PRESENT
#include "app_log.h"
#endif // SL_CATALOG_APP_LOG_PRESENT

#ifdef SL_CATALOG_BTMESH_WSTK_LCD_PRESENT
#include "sl_btmesh_wstk_lcd.h"
#endif // SL_CATALOG_BTMESH_WSTK_LCD_PRESENT

#include "cJSON.h"

#include "sensor_i2c_utils.h"
#include "sensor.h"
#include "as6212.h"
#include "flood_sensor.h"

/**************************************************************************//**
 * Definitions
 *****************************************************************************/
#define UINT16_TO_BYTES(n)            ((uint8_t) (n)), ((uint8_t)((n) >> 8))
#define UINT16_TO_BYTE0(n)            ((uint8_t) (n))
#define UINT16_TO_BYTE1(n)            ((uint8_t) ((n) >> 8))

#define BUFSIZE                       128
#define SPP_BUFF_SIZE                 128
#define USART_NEWLINE_TERMINATOR      '\n'

#define SERIAL_READY_PORT             gpioPortB
#define SERIAL_REQUEST_PIN            1
#define SERIAL_READY_PIN              2

#define SERIAL_TEMPERATURE_CMD        "temperature"
#define SERIAL_HUMIDITY_CMD           "humidity"
#define SERIAL_BATT_LVL_CMD           "batt"

/**************************************************************************//**
 * Declarations
 *****************************************************************************/
static sl_status_t
read_current_timestamp_characteristic (void);

static sl_status_t
update_current_timestamp_characteristic (sl_sleeptimer_timestamp_t timestamp);

static sl_status_t
update_current_temperature_characteristic (uint8_t current_temperature);

static sl_status_t
update_current_humidity_characteristic (uint8_t current_humidity);

static sl_status_t
update_battery_level_characteristic (uint16_t battery_level);

void
convert_overdue_data_to_byte_array (uint32_t *in_data, uint8_t *out_data);

static sl_status_t
update_agregate_characteristic (uint32_t *agregate_data_array);

static sl_status_t
update_spp_characteristic (uint8_t *data);

static sl_status_t
read_spp_characteristic (uint8_t *data);

bool
blocking_serial_is_available (void);

bool
blocking_serial_write (uint8_t *buff, uint32_t buff_sz);

size_t
blocking_serial_read (uint8_t *data, uint8_t terminator);

void
blocking_serial_hw_control (bool connected);

bool
check_if_command_is_valid (char *inJson, size_t len, char *command,
                           uint8_t *value);
bool
parse_incoming_data_str (char *rxPacket);

float
convert_array_to_float (uint8_t *array);

uint8_t*
convert_uint32_to_array (uint32_t value);

uint8_t*
convert_float_to_array (float value);

uint32_t
convert_float_to_uint32_big_endian (float value);

uint32_t
convert_float_to_uint32_little_endian (float value);

static sl_status_t
update_current_internal_sensor_temperature_characteristic (
    uint32_t current_temperature);

static sl_status_t
update_current_internal_sensor_humidity_characteristic (
    uint32_t current_humidity);

static sl_status_t
update_internal_agregate_characteristic (uint32_t *agregate_data_array);

/**************************************************************************//**
 * Handlers
 *****************************************************************************/
sl_sleeptimer_timer_handle_t app_timer_handler, app_agregate_timer_handler;
sl_sleeptimer_date_t datetime;
sl_sleeptimer_timestamp_t timestamp;

/**************************************************************************//**
 * Application global variables
 *****************************************************************************/
float app_temperature_value;
int app_humidity_value;
sl_sleeptimer_timestamp_t last_timestamp;

struct
{
  uint8_t flags_len;     // Length of the Flags field.
  uint8_t flags_type;    // Type of the Flags field.
  uint8_t flags;         // Flags field.
  uint8_t mandata_len;   // Length of the Manufacturer Data field.
  uint8_t mandata_type;  // Type of the Manufacturer Data field.
  uint8_t comp_id[2];    // Company ID field.
  uint8_t beac_type[2];  // Beacon Type field.
  uint8_t uuid[16]; // 128-bit Universally Unique Identifier (UUID). The UUID is an identifier for the company using the beacon.
  uint8_t maj_num[2];    // Beacon major number. Used to group related beacons.
  uint8_t min_num[2]; // Beacon minor number. Used to specify individual beacons within a group.
  uint8_t tx_power; // The Beacon's measured RSSI at 1 meter distance in dBm. See the iBeacon specification for measurement guidelines.
} bcn_beacon_adv_data =
  {
  // Flag bits - See Bluetooth 4.0 Core Specification , Volume 3, Appendix C, 18.1 for more details on flags.
      2,// Length of field.
      0x01,         // Type of field.
      0x04 | 0x02,  // Flags: LE General Discoverable Mode, BR/EDR is disabled.

      // Manufacturer specific data.
      26,// Length of field.
      0xFF, // Type of field.

      // The first two data octets shall contain a company identifier code from
      // the Assigned Numbers - Company Identifiers document.
        { UINT16_TO_BYTES(0x03aa) },

      // Sensor type
        { UINT16_TO_BYTE1(0xAAAA), UINT16_TO_BYTE0(0xBBBB) },

      // 128 bit / 16 byte UUID
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
            0x00, 0x00, 0x00, 0x00, 0x00 },

      // Beacon major number.
      // Set to 34987 and converted to correct format.
        { UINT16_TO_BYTE1(34987), UINT16_TO_BYTE0(34987) },

      // Beacon minor number.
      // Set as 1025 and converted to correct format.
        { UINT16_TO_BYTE1(1025), UINT16_TO_BYTE0(1025) },

