CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
      // The Beacon's measured RSSI at 1 meter distance in dBm.
      // 0xD7 is -41dBm
      0xD7 };

enum
{
  DISABLED = 0, ENABLED, NONE
};

typedef union
{
  uint8_t bytes[4];
  float number;
  uint32_t uint32_number;

} FLOATUNION_t;

typedef union
{
  uint8_t bytes[2];
  uint16_t number;

} UINT16UNION_t;

static uint8_t input_uart_buffer[SPP_BUFF_SIZE];
static uint8_t temp_buffer[SPP_BUFF_SIZE];

// Application ready flags
static bool agregate_notify_flag, internal_agregate_notify_flag,
    is_client_connected = false;

static uint8_t ble_adv_state;

// The advertising set handle allocated from Bluetooth stack.
static uint8_t advertising_set_handle = 0xff;

s_irqEventSensor_t floodSensor;

static void
test_fun (void)
{
  uint32_t read[2];
  uint32_t write[2];

  sensorClearDataBuffer ();

  write[0] = sensorGetRamStorageCurrentIndex ();
  write[1] = 'A';
  sensorPutDataToRamStorage (write, sizeof(write));

  write[0] = sensorGetRamStorageCurrentIndex ();
  write[1] = 'B';
  sensorPutDataToRamStorage (write, sizeof(write));

  write[0] = sensorGetRamStorageCurrentIndex ();
  write[1] = 'C';
  sensorPutDataToRamStorage (write, sizeof(write));

  write[0] = sensorGetRamStorageCurrentIndex ();
  write[1] = 'D';
  sensorPutDataToRamStorage (write, sizeof(write));

  write[0] = sensorGetRamStorageCurrentIndex ();
  write[1] = 'E';
  sensorPutDataToRamStorage (write, sizeof(write));

  write[0] = sensorGetRamStorageCurrentIndex ();
  write[1] = 'F';
  sensorPutDataToRamStorage (write, sizeof(write));
}

void
pinInterruptCallback (uint8_t port, uint8_t pin)
{
  char buf[64];
  sprintf (buf, "Pin callback from: %d and pin: %d\n", port, pin);
  blocking_serial_write ((uint8_t*) buf, strlen (buf));

  // update pin irq notification characteristic ->>> todo
}

/**************************************************************************//**
 * Application Sleeptimer callback
 *****************************************************************************/
void
periodic_timer_callback (sl_sleeptimer_timer_handle_t *handle, void *data)
{
  (void) handle;
  (void) data;

  // Update timestamp value
  update_current_timestamp_characteristic (sl_sleeptimer_get_time ());
}

void
periodic_agregate_timer_callback (sl_sleeptimer_timer_handle_t *handle,
                                  void *data)
{
  (void) handle;
  (void) data;

  uint32_t agrBuff[4];
  static uint32_t readIdx;

  sensorGetDataFromRamStorage (agrBuff, sizeof(agrBuff), ++readIdx);

  if (agrBuff[0])
    {
      update_internal_agregate_characteristic (agrBuff);
    }
  else
    {
      readIdx = 0;
    }
}

/***************************************************************************//**
 * Application Init.
 ******************************************************************************/
SL_WEAK void
app_init (void)
{
  sl_status_t sc;

  USART_InitAsync_TypeDef initAsync = USART_INITASYNC_DEFAULT;
  USART_InitAsync (USART1, &initAsync);

  //I2C_Init_TypeDef initI2c = I2C_INIT_DEFAULT;
  //I2C_Init(NULL, &initI2c);

  // Disable overdue data notifying
  agregate_notify_flag = internal_agregate_notify_flag = false;

  ble_adv_state = DISABLED;

  // Initialize datetime with WALL_CLOCK enabled in RTC
  sc = sl_sleeptimer_init ();

  // Initialize date-time wiht default values
  sl_sleeptimer_build_datetime (&datetime, 2022, MONTH_JANUARY, 1, 12, 00, 00,
                                0);
  // Set current datetime
  sc = sl_sleeptimer_set_datetime (&datetime);

  // Convert current date to UNX epoch format
  sc = sl_sleeptimer_convert_date_to_time (&datetime, &timestamp);

  // Set current date in UNIX epoch format
  sc = sl_sleeptimer_set_time (timestamp);

  // Enable periodic application timer
  sl_sleeptimer_start_periodic_timer (&app_timer_handler, 3000,
                                      periodic_timer_callback, (void*) NULL, 0,
                                      0);

  // Initialize connection indicator pin
  GPIO_PinModeSet (SERIAL_READY_PORT, SERIAL_READY_PIN, gpioModePushPull, 1);
  GPIO_PinOutClear (SERIAL_READY_PORT, SERIAL_READY_PIN);

  // Initialize wake-ip pin (USART)
  GPIO_PinModeSet (SERIAL_READY_PORT, SERIAL_REQUEST_PIN, gpioModeInputPull, 1);

  // Sends invitation string via USART
  uint8_t uart_hello_str[] =
    { "Hello EFR32BG22 - BLE Template - ver 1.2[Pajak]\n" };
  blocking_serial_write (uart_hello_str, strlen ((char*) uart_hello_str));

  // Initialize AS6212 temperature sensor
  sensorInit (AS6212);

  // Initialize IRQ sensor
  floodSensor.floodSensorPort = gpioPortA;
  floodSensor.floodSensorPin = 0;
  irqSensorInitialization (&floodSensor, pinInterruptCallback);

  // Clear data storage buffer
  sensorClearDataBuffer ();
}

uint32_t write[4];

/***************************************************************************//**
 * Application Process Action.
 ******************************************************************************/
SL_WEAK void
app_process_action (void)
{
  // Check external IRQ
  irqSensor_EVENT (&floodSensor);

  // Checks hardware pins to allows serial communication
  blocking_serial_hw_control (is_client_connected);

  // Check if USART register contains valid data,
  // if not, go to the EM2 sleep mode
  if (blocking_serial_is_available ())
    {
      //Reads data from USART
      if (blocking_serial_read (temp_buffer, USART_NEWLINE_TERMINATOR) == true)
        {
          // Update SPP characteristic value
          update_spp_characteristic (temp_buffer);

          // Parse incoming data
          if (!parse_incoming_data_str ((char*) input_uart_buffer))
            blocking_serial_write ((uint8_t*) "JSON error\n",
                                   strlen ("JSON error\n"));
          else
            blocking_serial_write ((uint8_t*) "OK\n", strlen ("OK\n"));

          memset (temp_buffer, 0, SPP_BUFF_SIZE);
        }
    }
  else if (GPIO_PinInGet (SERIAL_READY_PORT, SERIAL_REQUEST_PIN))
    {
      // Let the CPU go to sleep if the system allows it.
      sl_power_manager_sleep ();
    }

  if (sl_sleeptimer_get_time () - last_timestamp > 10)
    {
      last_timestamp = sl_sleeptimer_get_time ();

      // Update internal sensor temperature characteristic
      sensorGetTemperatureC (0, &app_temperature_value);

      // Fill temporary buffer
      write[0] = sensorGetRamStorageCurrentIndex ();
      write[1] = sl_sleeptimer_get_time ();
      write[2] = 0xAAFF; // Data type
      write[3] = convert_float_to_uint32_big_endian (app_temperature_value);

