CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
      // Put current data to ring-buffer
      sensorPutDataToRamStorage (write, sizeof(write));

      // Update the temperature characteristic
      update_current_internal_sensor_temperature_characteristic (
          convert_float_to_uint32_little_endian (app_temperature_value));
      update_current_internal_sensor_humidity_characteristic (
          convert_float_to_uint32_little_endian (app_humidity_value));

      // Print on uart
      blocking_serial_write ((uint8_t*) "Runtime sensor read time\n",
                             strlen ("Runtime sensor read time\n"));

    }

}

/**************************************************************************//**
 * Controls the pins that allow communication through the serial port.
 *
 *****************************************************************************/
void
blocking_serial_hw_control (bool connected)
{
  connected ?
      GPIO_PinOutSet (SERIAL_READY_PORT, SERIAL_READY_PIN) :
      GPIO_PinOutClear (SERIAL_READY_PORT, SERIAL_READY_PIN);
}

/**************************************************************************//**
 * Check if serial has valid data
 *
 *****************************************************************************/
bool
blocking_serial_is_available (void)
{
  return USART_StatusGet (USART1) & USART_STATUS_RXDATAV;
}

/**************************************************************************//**
 * Blocking USART write
 *
 *****************************************************************************/
bool
blocking_serial_write (uint8_t *buff, uint32_t buff_sz)
{
  uint8_t c;

  if (!buff_sz || buff == NULL)
    return false;

  while (buff_sz)
    {
      c = *buff++;
      USART_Tx (USART1, c);
      buff_sz--;
    }

  while (!(USART_StatusGet (USART1) & USART_STATUS_TXC))
    ;

  return true;
}

/**************************************************************************//**
 * Blocking USART read
 *
 *****************************************************************************/
size_t
blocking_serial_read (uint8_t *data, uint8_t terminator)
{
  int8_t c = 0;
  static uint8_t index = 0;

  /* Retrieve characters, print local echo and full line back */
  c = USART_Rx (USART1);
  if (c > 0)
    {
      if (c == terminator)
        {
          input_uart_buffer[index] = '\0';
          memcpy (data, input_uart_buffer, index);
          index = 0;

          return true;
        }
      else
        {
          if (index < BUFSIZE - 1)
            {
              input_uart_buffer[index] = c;
              index++;
            }
        }
    }

  return false;
}

/**************************************************************************//**
 * Setup and enable iBeacon advertising
 * (scannable & connectable)
 *
 *****************************************************************************/
static void
bcn_setup_adv_beaconing (void)
{
  sl_status_t sc;
  int16_t ret_power_min, ret_power_max;

  // Set 0 dBm maximum Transmit Power.
  sc = sl_bt_system_set_tx_power (SL_BT_CONFIG_MIN_TX_POWER, 0, &ret_power_min,
                                  &ret_power_max);

  // Create an advertising set.
  sc = sl_bt_advertiser_create_set (&advertising_set_handle);

  // Set custom advertising data.
  sc = sl_bt_advertiser_set_data (advertising_set_handle, 0,
                                  sizeof(bcn_beacon_adv_data),
                                  (uint8_t*) (&bcn_beacon_adv_data));

  // Set advertising parameters. 100ms advertisement interval.
  sc = sl_bt_advertiser_set_timing (advertising_set_handle, 1000, // min. adv. interval (milliseconds * 1.6)
                                    1000, // max. adv. interval (milliseconds * 1.6)
                                    0,       // adv. duration
                                    0);      // max. num. adv. events

  // Start advertising in user mode and disable connections.
  sc = sl_bt_advertiser_start (advertising_set_handle,
                               sl_bt_advertiser_user_data,
                               sl_bt_advertiser_connectable_scannable);

}

/**************************************************************************//**
 * Bluetooth stack event handler.
 * This overrides the dummy weak implementation.
 *
 * @param[in] evt Event coming from the Bluetooth stack.
 *****************************************************************************/
void
sl_bt_on_event (sl_bt_msg_t *evt)
{
  sl_status_t sc;
  bd_addr address;
  uint8_t address_type;
  uint8_t system_id[8];
  uint8_t spp_recv_data[128];

  memset (spp_recv_data, 0, sizeof(spp_recv_data));

  switch (SL_BT_MSG_ID(evt->header))
    {
    // -------------------------------
    // This event indicates the device has started and the radio is ready.
    // Do not call any stack command before receiving this boot event!
    case sl_bt_evt_system_boot_id:
      // Extract unique ID from BT Address.
      sc = sl_bt_system_get_identity_address (&address, &address_type);

      // Pad and reverse unique ID to get System ID.
      system_id[0] = address.addr[5];
      system_id[1] = address.addr[4];
      system_id[2] = address.addr[3];
      system_id[3] = 0xFF;
      system_id[4] = 0xFE;
      system_id[5] = address.addr[2];
      system_id[6] = address.addr[1];
      system_id[7] = address.addr[0];

      sc = sl_bt_gatt_server_write_attribute_value (gattdb_system_id, 0,
                                                    sizeof(system_id),
                                                    system_id);

      bcn_setup_adv_beaconing ();

      // Initialize SPP characteristic
      memset (input_uart_buffer, 0, SPP_BUFF_SIZE);

      // Update SPP characteristic value
      update_spp_characteristic ((uint8_t*) input_uart_buffer);

      break;

      // This event indicates that a new connection was opened.
    case sl_bt_evt_connection_opened_id:

      // Change flag status after connecting
      is_client_connected = true;
      break;

      // This event indicates that a connection was closed.
    case sl_bt_evt_connection_closed_id:

      // Change flag status after connecting
      is_client_connected = false;

      // Start advertising in user mode and disable connections.
      sc = sl_bt_advertiser_start (advertising_set_handle,
                                   sl_bt_advertiser_user_data,
                                   sl_bt_advertiser_connectable_scannable);
      break;

      // -------------------------------
      // This event indicates that the value of an attribute in the local GATT
      // database was changed by a remote GATT client.
    case sl_bt_evt_gatt_server_attribute_value_id:

      // The value of the gattdb_spp characteristic was changed.
      if (gattdb_spp
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          // Reading data from SPP characteristic and puts to the USART
          sc = read_spp_characteristic (spp_recv_data);
          blocking_serial_write (spp_recv_data, strlen ((char*) spp_recv_data));
        }

