CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
      // The value of the gattdb_timestamp characteristic was changed.
      if (gattdb_timestamp
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          sc = read_current_timestamp_characteristic ();
        }

      break;

      // -------------------------------
      // This event occurs when the remote device enabled or disabled the
      // notification request.
    case sl_bt_evt_gatt_server_characteristic_status_id:

      if (gattdb_aggregate
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          if (evt->data.evt_gatt_server_characteristic_status.client_config_flags
              & sl_bt_gatt_notification)
            {
              // todo
            }
          else
            {
              // todo
            }
        }

      if (gattdb_internal_aggregate
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          if (evt->data.evt_gatt_server_characteristic_status.client_config_flags
              & sl_bt_gatt_notification)
            {

              sl_sleeptimer_start_periodic_timer (
                  &app_agregate_timer_handler, 300,
                  periodic_agregate_timer_callback, (void*) NULL, 0, 0);
            }
          else
            {
              sl_sleeptimer_stop_timer (&app_agregate_timer_handler);
            }
        }

      break;

    case sl_bt_evt_advertiser_timeout_id:
      // todo advertising timeout  (do nothing?!)
      break;

      // -------------------------------
      // Default event handler.
    default:
      break;
    }

}

/***************************************************************************//**
 * Reads current timestamp
 ******************************************************************************/
static sl_status_t
read_current_timestamp_characteristic (void)
{
  sl_status_t sc;
  sl_sleeptimer_timestamp_t timestamp = 0;
  uint8_t time_buff[4];
  size_t data_recv_len;

  // Read characteristic value.
  sl_bt_gatt_server_read_attribute_value (gattdb_timestamp, 0,
                                          sizeof(time_buff), &data_recv_len,
                                          time_buff);

  // Convert uint8 array to uint32
  timestamp = time_buff[0] | (time_buff[1] << 8) | (time_buff[2] << 16)
      | (time_buff[3] << 24);

  // Update time in RTC
  sc = sl_sleeptimer_set_time (timestamp);

  return sc;
}

/******************************************************************************
 * Updates the current timestamp characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_timestamp_characteristic (sl_sleeptimer_timestamp_t timestamp)
{
  sl_status_t sc;
  uint8_t time_buff[4];

  time_buff[0] = timestamp >> 24;
  time_buff[1] = timestamp >> 16;
  time_buff[2] = timestamp >> 8;
  time_buff[3] = timestamp;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_timestamp, 0,
                                                sizeof(time_buff), time_buff);
  return sc;
}

/******************************************************************************
 * Updates the current temperature characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_temperature_characteristic (uint8_t current_temperature)
{
  sl_status_t sc;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_temperature, 0,
                                                sizeof(current_temperature),
                                                &current_temperature);
  return sc;
}

/******************************************************************************
 * Updates the current humidity characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_humidity_characteristic (uint8_t current_humidity)
{
  sl_status_t sc;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_humidity, 0,
                                                sizeof(current_humidity),
                                                &current_humidity);
  return sc;
}

/******************************************************************************
 * Updates the battery level characteristic (write).
 ******************************************************************************/
static sl_status_t
update_battery_level_characteristic (uint16_t battery_level)
{
  sl_status_t sc;
  uint8_t batt_arr[2];

  UINT16_TO_BYTE1(1);

  batt_arr[0] = UINT16_TO_BYTE1(battery_level);
  batt_arr[1] = UINT16_TO_BYTE0(battery_level);

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_battery_level, 0,
                                                sizeof(batt_arr), batt_arr);

  return sc;
}

/******************************************************************************
 * Convert data to byte array in format : [2B-ID][4B-TS][2B-Type][4B-Data]
 ******************************************************************************/
void
convert_overdue_data_to_byte_array (uint32_t *in_data, uint8_t *out_data)
{
  out_data[0] = in_data[0] >> 24;
  out_data[1] = in_data[0] >> 16;
  out_data[2] = in_data[0] >> 8;
  out_data[3] = in_data[0];

  out_data[4] = in_data[1] >> 24;
  out_data[5] = in_data[1] >> 16;
  out_data[6] = in_data[1] >> 8;
  out_data[7] = in_data[1];

  out_data[8] = in_data[2] >> 8;
  out_data[9] = in_data[2];

  out_data[10] = in_data[3] >> 24;
  out_data[11] = in_data[3] >> 16;
  out_data[12] = in_data[3] >> 8;
  out_data[13] = in_data[3];
}

/******************************************************************************
 * Updates the overdue records (notification).
 ******************************************************************************/
static sl_status_t
update_agregate_characteristic (uint32_t *agregate_data_array)
{
  sl_status_t sc;
  uint8_t temp_buff[14];

  // Convert data to byte array
  convert_overdue_data_to_byte_array (agregate_data_array, temp_buff);

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_notify_all (gattdb_aggregate, sizeof(temp_buff),
                                     temp_buff);
  return sc;
}

