CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
/******************************************************************************
 * Writes to the SPP characteristic.
 ******************************************************************************/
static sl_status_t
update_spp_characteristic (uint8_t *data)
{
  sl_status_t sc;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_spp, 0, SPP_BUFF_SIZE,
                                                data);
  return sc;
}

/******************************************************************************
 * Reads from the SPP characteristic.
 ******************************************************************************/
static sl_status_t
read_spp_characteristic (uint8_t *data)
{
  size_t data_recv_len;

  // Read characteristic value.
  return sl_bt_gatt_server_read_attribute_value (gattdb_spp, 0,
  SPP_BUFF_SIZE,
                                                 &data_recv_len, data);
}

/******************************************************************************
 * Check if incoming data string is valid.
 ******************************************************************************/
bool
check_if_command_is_valid (char *inJson, size_t len, char *command,
                           uint8_t *value)
{
  bool retValue = false;
  const cJSON *hash = NULL;

  cJSON *jsonObj = cJSON_ParseWithLength (inJson, len);
  if (jsonObj == NULL)
    {
      return retValue;
    }

  hash = cJSON_GetObjectItemCaseSensitive (jsonObj, command);

  if (cJSON_IsString (hash) && (hash->valuestring != NULL))
    {
      memcpy (value, hash->valuestring, strlen (hash->valuestring));
      retValue = true;
    }
  else
    {
      value = NULL;
      retValue = false;
    }

  cJSON_Delete (jsonObj);

  return retValue;
}

/******************************************************************************
 * Parse incoming data string
 ******************************************************************************/
bool
parse_incoming_data_str (char *rxPacket)
{
  uint8_t value_array[32];

  if (check_if_command_is_valid (rxPacket, strlen (rxPacket),
  SERIAL_TEMPERATURE_CMD,
                                 value_array))
    {
      update_current_temperature_characteristic (
          (uint8_t) atoi ((char*) value_array));
      //blocking_serial_write (value_array, strlen ((char*) value_array));
      return true;
    }

  if (check_if_command_is_valid (rxPacket, strlen (rxPacket),
  SERIAL_HUMIDITY_CMD,
                                 value_array))
    {
      update_current_humidity_characteristic (
          (uint8_t) atoi ((char*) value_array));
      //blocking_serial_write (value_array, strlen ((char*) value_array));
      return true;
    }

  if (check_if_command_is_valid (rxPacket, strlen (rxPacket),
  SERIAL_BATT_LVL_CMD,
                                 value_array))
    {
      update_battery_level_characteristic (atoi ((char*) value_array));
      //blocking_serial_write (value_array, strlen ((char*) value_array));
      return true;
    }

  // ...
  return false;
}

/******************************************************************************
 * Convert from unsigned int8 array to float
 ******************************************************************************/
float
convert_array_to_float (uint8_t *array)
{
  FLOATUNION_t converter;
  memcpy (converter.bytes, array, sizeof(float));

  return converter.number;
}

/******************************************************************************
 * Convert from float to uint8_t array
 ******************************************************************************/
uint8_t*
convert_float_to_array (float value)
{
  static uint8_t temp_buff[4];

  FLOATUNION_t converter;
  converter.number = value;

  memcpy (temp_buff, converter.bytes, sizeof(float));
  return temp_buff;
}

/******************************************************************************
 * Convert from uint32_t to uint8_t array
 ******************************************************************************/
uint8_t*
convert_uint32_to_array (uint32_t value)
{
  static uint8_t temp_buff[4];

  FLOATUNION_t converter;
  converter.uint32_number = value;

  memcpy (temp_buff, converter.bytes, sizeof(float));
  return temp_buff;
}

/******************************************************************************
 * Convert from float to uint32_t (big endian)
 ******************************************************************************/
uint32_t
convert_float_to_uint32_big_endian (float value)
{
  uint32_t ret_value;

  FLOATUNION_t converter;
  converter.number = value;

  ret_value = converter.bytes[3] << 24;
  ret_value |= converter.bytes[2] << 16;
  ret_value |= converter.bytes[1] << 8;
  ret_value |= converter.bytes[0];

  return ret_value;
}

/******************************************************************************
 * Convert from float to uint32_t (little endian)
 ******************************************************************************/
uint32_t
convert_float_to_uint32_little_endian (float value)
{
  uint32_t ret_value;

  FLOATUNION_t converter;
  converter.number = value;

  ret_value = converter.bytes[0] << 24;
  ret_value |= converter.bytes[1] << 16;
  ret_value |= converter.bytes[2] << 8;
  ret_value |= converter.bytes[3];

  return ret_value;
}

static sl_status_t
update_current_internal_sensor_temperature_characteristic (
    uint32_t current_temperature)
{
  sl_status_t sc;
  uint8_t *temp_buff;

  temp_buff = convert_uint32_to_array (current_temperature);

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_internal_temperature, 0,
                                                4, temp_buff);
  return sc;
}

/******************************************************************************
 * Updates the internal sensor current humidity characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_internal_sensor_humidity_characteristic (
    uint32_t current_humidity)
{
  sl_status_t sc;
  uint8_t *temp_buff;

  temp_buff = convert_uint32_to_array (current_humidity);

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_internal_humidity, 0, 4,
                                                temp_buff);
  return 0;
}

/******************************************************************************
 * Updates the internal agregate characteristic (write).
 ******************************************************************************/
static sl_status_t
update_internal_agregate_characteristic (uint32_t *agregate_data_array)
{
  sl_status_t sc;
  uint8_t temp_buff[14];

  // Convert data to byte array
  convert_overdue_data_to_byte_array (agregate_data_array, temp_buff);

  sc = sl_bt_gatt_server_notify_all (gattdb_internal_aggregate,
                                     sizeof(temp_buff), temp_buff);

  return sc;
}
